ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке</registerRecords>
  <attributes>
    <name>cbr_КоличествоПаллет</name>
    <comment>//++ БаженоваЕО 09.02.2026 СКЛ.4</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НомерЗаявкиПоДаннымПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НомерПеревозкиAtrucks</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ФактическаяСтоимостьПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="15b3905e-1f40-4d8c-9f31-cde2f3907a9e">
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Enums/ТипыИсполнителейЗаданийНаПеревозку/ТипыИсполнителейЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb378302-d95b-4135-bffd-6239a0199221">
  <name>ТипыИсполнителейЗаданийНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>cbr_НеУчаствуемВДоставке</name>
    <comment>//++ БаженоваЕО 02.02.2026 СКЛ.4</comment>
  </enumValues>
  <enumValues extendedConfigurationObject="a8905e3a-939f-4248-8255-c2c1f39d3143">
    <name>НашаТранспортнаяСлужба</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d5f011ed-9752-4da4-989a-fbf936cffbff">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаданиеНаПеревозку/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура cbr_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//++ БаженоваЕО 13.02.2026 СКЛ.4
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Или ТипЗнч(ДанныеЗаполнения) = Тип(
		"ДокументСсылка.ЗаказПоставщику") Тогда

		Дата = ТекущаяДата();
		Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
		Склад = ДанныеЗаполнения.Склад;
		Ответственный = Пользователи.ТекущийПользователь();
		ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.cbr_НеУчаствуемВДоставке;
		Статус = Перечисления.СтатусыЗаданийНаПеревозку.Формируется;

		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Операция = Перечисления.ВидыДоставки.СоСклада;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Операция = Перечисления.ВидыДоставки.НаСклад;
		КонецЕсли;

		НоваяСтрокаМаршрут = Маршрут.Добавить();
		НоваяСтрокаМаршрут.Адрес = ДанныеЗаполнения.АдресДоставки;
		
		ВесНоменклатуры = 0;
		Для Каждого Стр Из ДанныеЗаполнения.Товары Цикл
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЧислитель") <> 0
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЗнаменатель") <> 0 Тогда
				ВесНоменклатуры = ВесНоменклатуры + (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура,
					"ВесЧислитель") / ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "ВесЗнаменатель")
					* Стр.КоличествоУпаковок);
			КонецЕсли;
		КонецЦикла;
		
		НоваяСтрокаМаршрут.Вес = ВесНоменклатуры;
		НоваяСтрокаМаршрут.КлючСвязи = Строка(Новый УникальныйИдентификатор);

		НоваяСтрокаРаспоряжение = Распоряжения.Добавить();
		НоваяСтрокаРаспоряжение.КлючСвязи = НоваяСтрокаМаршрут.КлючСвязи;
		НоваяСтрокаРаспоряжение.Склад = ДанныеЗаполнения.Склад;
		НоваяСтрокаРаспоряжение.Распоряжение = ДанныеЗаполнения;
		НоваяСтрокаРаспоряжение.ПолучательОтправитель = ДанныеЗаполнения.Партнер;

	КонецЕсли;
	//-- БаженоваЕО 13.02.2026

КонецПроцедуры

&После("ПередЗаписью")
Процедура cbr_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++cbr-larkovgeorg 26.02.2026 СКЛ.12
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	cbr_КоличествоПаллет = Документы.ЗаданиеНаПеревозку.cbr_ИтоговоеКоличествоПаллетов(Маршрут);
	//--cbr-larkovgeorg 26.02.2026 СКЛ.12
КонецПроцедуры
#КонецОбласти
